# coding=utf8

__author__ = "luocheng"
"""
maintained by franky
    Now we have 43 participants.
"""

class DataHub:
    """
    args: None
    return: Student Id (str):Config (file)
    """


    def getId2Config(self):
        student_ids = {
            '2016011373': 1,
            '2016011286': 2,
            '2016011336': 3,
            '2015012244': 4,
            '2016011386': 1,
            '2014010588': 2,
            '2014080102': 3,
            '2016011396': 4,
            '2016011304': 1,
            '2016050024': 3,
            '2016011258': 4,
            '2013011361': 1,
            '2014310617': 2,
            '2014012280': 3,
            '2016011284': 4,
            '2016011257': 1,
            '2013012645': 2,
            '2016011392': 3,
            '2015010872': 4,
            '2016011317': 1,
            '2014080129': 2,
            '2014080118': 3,
            '2016011311': 4,
            '2014080121': 2,
            '2015010889': 3,
            '2015010887': 4,
            '2013010932': 1,
            '2016210747': 2,
            '2015210462': 3,
            '2013012048': 4,
            '2014010012': 1,
            '2014210115': 2,
            '2014011525': 3,
            '2014012023': 1,
            '2014010974': 2,
            '2014011335': 3,
            '2016211454': 4,
            '2013012692': 1,
            '2016310173': 2,
            '2016211123': 3,
            '2013012056': 4,
            '2016211313': 1,
            '2015311241': 2,
        }
        return student_ids

    """
    args: None
    return: a set object of valid ids
    """

    def getValidId(self):
        return self.getId2Config().keys()


    def id2query(self, id):
        mp = {
            0: '肚子胖怎样减肥',
            1:'中国带州的城市',
            2:'去香港要办什么手续',
            3:'变频空调和定频空调的区别',
            4:'广州有哪里好玩',
            5:'德国影院枪击案',
            6:'2016河南高考状元',
            7:'诗经中最唯美的句子',
            8:'price tag 歌词',
            9:'蓝莓为什么对眼睛好',
            10:'白芷的功效与作用',
            11:'小毛驴儿歌视频',
            12:'横县临江壮歌剧',
            13:'范玮琪',
            14:'休杰克曼',
            15:'中南大学官网',
            16:'下关一中',
            17:'婆婆灰',
            18:'跛脚是什么意思',
            19:'邢台崆山白云洞门票多少',
            20:'手游穿越火线'
        }
        return mp[id]


    """
    args: setting id, task id

    return: str source of the serp
    """
    def getSource(self, setting, taskid):
        source = [
            [1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4],
            [2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 1, 1, 1, 1, 1],
            [3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2],
            [4, 4, 4, 4, 4, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]
        ]
        _s = source[setting-1][taskid-1]

        names = ['sogou', 'baidu','sm','haosou']
        return names[_s-1]